package com.java.books.java8.beginners_guide.chapter_5.page_184.a;

public class Str {
    /*

boolean equals (str)
Возвращает логическое значение true,
если текущая строка содержит ту же последовательность символов,
что и параметр str.

int length ( )
Возвращает длину строки

char charAt ( index)
Возвращает символ, занимающий в строке позицию,
указываемую параметром index

int compareTo (String str)
Возвращает отрицательное значение, если текущая строка
меньше строки str;
нуль, если эти строки ровны, и положительное значение,
если текущая строка больше строки str.

int indexOf(String str)
Выполняет в текущей строке поиск подстроки, определяемой
параметром str. Возвращает индекс первого вхождения
подстроки str или -1, если поиск завершается неудачно

int lastindexOf (String str)
Производит в текущей строке поиск подстроки, определяемой параметром s tr.
Возвращает индекс последнего вхождения подстроки str или -1, если поиск завершаетсянеудачно

     */
}
